{
  "name": "didata by Rabelus Lab",
  "description": "Briefing Técnico-Didático\n\nO Didata não é apenas uma plataforma de cursos, mas um ecossistema de aprendizado adaptativo que transforma informações estáticas (como livros e textos extensos) em uma jornada educacional dinâmica e interativa.\n\nAbaixo, apresentamos o briefing técnico-didático da solução:-----1. O Conceito: O que é o Didata?\n\nO Didata é um Arquiteto Pedagógico de IA.\n\nImagine ter um livro técnico de 500 páginas. Em vez de apenas lê-lo, o Didata \"consome\" esse conteúdo e reconstrói uma estrutura de curso completa, dividida em módulos lógicos e aulas sequenciais, criando um ambiente onde você pode conversar com o próprio conhecimento.-----2. Os Três Pilares de FuncionamentoA. Estruturação Inteligente (O Arquiteto)\n\nUtilizando o modelo Gemini 3 Flash, a plataforma analisa grandes volumes de texto para identificar temas centrais e objetivos de aprendizagem. Ele aplica metodologias Reais de design instrucional (como a Taxonomia de Bloom) para garantir que o curso tenha um começo, meio e fim com sentido pedagógico.B. Geração de Conteúdo Profundo (O Didata)\n\nPara cada aula gerada, o modelo Gemini 3 Pro entra em ação. Ele não apenas resume; ele expande o conteúdo com uma \"capacidade de reflexão\" (Thinking Budget), criando textos didáticos ricos com:\nExemplos práticos.\nAlertas visuais (dicas, notas e avisos).\nFormatação que facilita a leitura rápida.\nC. O Tutor Socrático (O Link Neural)\n\nEste é o diferencial tecnológico. Através da Gemini Live API, o Didata oferece um professor particular por voz em tempo real:\nMétodo Socrático: Ele não entrega a resposta pronta. Ele faz perguntas para que o aluno descubra o caminho.\nVoz Nativa: Não é uma leitura robótica; é uma conversa fluida com entonação humana, onde você pode interromper e tirar dúvidas como em uma chamada de vídeo.\n-----3. Destaques da Experiência (UX/UI)\nDesign Futurista (Glassmorphism): A interface utiliza um visual de \"vidro fosco\" sobre um fundo espacial, evocando a ideia de tecnologia de ponta e expansão do conhecimento.\nPrivacidade e Velocidade: Utilizamos um banco de dados local (IndexedDB) dentro do seu navegador. Suas missões de estudo e históricos de chat ficam salvos no seu dispositivo, garantindo acesso instantâneo e privado.\nVisualização Neural: Enquanto você fala com o tutor, um visualizador de ondas sonoras reagente mostra a \"atividade cerebral\" da IA, tornando a interação mais humana e menos intimidante.\n-----4. Por que o Didata é Diferente?\n\nA maioria das ferramentas de IA apenas responde perguntas. O Didata organiza o caos.\n\nEle pega uma massa bruta de dados e a transforma em um currículo estruturado. Ele remove a barreira da \"página em branco\" para professores e a barreira da \"procrastinação\" para alunos, transformando o estudo em uma conversa ativa e envolvente.-----Em resumo: O Didata é a ponte entre a informação bruta e o conhecimento absorvido, usando o que há de mais moderno em inteligência artificial generativa e processamento de áudio em tempo real.\n\n",
  "requestFramePermissions": [
    "microphone"
  ]
}